{
  "profile": {
    "name": "Andrew Nguyen",
    "title": "SOFTWARE ENGINEER | FULL STACK DEVELOPER",
    "location": "Adelaide, SA",
    "clearance": "",
    "photo": "/api/placeholder/400/600",
    "description": "Highly skilled and adaptable Full-Stack Software Engineer with a proven track record in designing, developing, and deploying robust and scalable applications.  Expertise spans the entire software development lifecycle, from front-end development using JavaScript, TypeScript, and React to back-end solutions leveraging Express.js and .NET.  Adept at building data-driven applications, optimizing performance for seamless user experiences, and integrating with various APIs and cloud services (AWS S3, RDS, EC2).  Possessing a proactive mindset and strong problem-solving abilities, I consistently deliver high-quality solutions in fast-paced environments, collaborating effectively within agile teams to meet project goals and exceed client expectations. My experience encompasses the development of intelligent automation systems, real-time data visualization tools, and optimized algorithms for enhanced efficiency and profitability, as demonstrated by quantifiable achievements in streamlining workflows, improving lead generation, and boosting production profits.",
    "description2": "My passion for continuous learning and innovation is reflected in my diverse portfolio of personal projects, showcasing proficiency in various technologies and frameworks.  These projects demonstrate my ability to independently conceptualize, design, and implement full-stack applications, integrating cutting-edge technologies such as AI image generation and real-time cryptocurrency tracking.  I am proficient in utilizing various databases (MySQL, PostgreSQL, MongoDB, SQLite) and cloud services (AWS), and possess a strong understanding of architectural principles including object-oriented design, parallel and distributed computing, microservices, and serverless architectures.  My commitment to delivering exceptional results, coupled with my strong communication and collaboration skills, makes me a valuable asset to any team seeking a highly capable and driven full-stack software engineer."
  },
  "qualifications": [
    "Bachelor of Computer Science, The University of Adelaide"
  ],
  "affiliations": [
    "Information not available"
  ],
  "skills": [
    "JavaScript/TypeScript/React",
    "Python",
    "C#/.NET",
    "Node.js/Express.js",
    "AWS",
    "SQL",
    "Agile/Scrum",
    "Data Visualization"
  ],
  "keyAchievements": [
    "Streamlined outreach workflows by 60% and improved client engagement rates by 25% at UPP Global Technology JSC by developing a data-driven prospecting system.",
    "Boosted production profits by 25% at The University of Adelaide by developing a constraint generation algorithm for optimizing meat cutting patterns.",
    "Reduced page load time by 30% at VNPT by optimizing React.js codebase through code splitting and lazy loading."
  ],
  "experience": [
    {
      "title": "Software Engineer - UPP Global Technology JSC (Remote)",
      "period": "Jan 2025 – March 2025",
      "responsibilities": [
        "Developed a data-driven prospecting system that automated client discovery and streamlined workflows by 60%, improving client engagement by 25%.",
        "Developed an intelligent automation system using Python to extract and process over 500 qualified sales leads.",
        "Engineered a resilient automation framework with bot detection bypass and Salesforce integration, eliminating manual data entry."
      ]
    },
    {
      "title": "Software Engineer - Deloitte",
      "period": "Nov 2023 – Jan 2024",
      "responsibilities": [
        "Developed an efficient method to handle public transport data from RESTful APIs using Node.js, serving over 30,000 users.",
        "Developed a dynamic map using React and Leaflet to visualize transport data, enhancing accessibility by 35%.",
        "Actively participated in Scrum and Agile processes, collaborating with cross-functional teams."
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Software Engineer - UPP Global Technology JSC (Remote)",
      "period": "Jan 2025 – March 2025",
      "responsibilities": [
        "Collaborated in a team of two under senior mentorship, working closely with different sales teams to deliver a data-driven prospecting system.",
        "This system automated client discovery, streamlined outreach workflows by 60%, and improved client engagement rates by 25%.",
        "Developed an intelligent automation system using Python and custom network request capture techniques to extract and process over 500 qualified sales leads from an external platform.",
        "Engineered a resilient automation framework with bot detection bypass mechanisms and API integration to Salesforce Sales Cloud.",
        "This reduced manual data entry time by 100% and enhanced lead generation workflow.",
        "Assisted in building continuous integration/deployment processes using GitLab CI/CD, enabling automated testing and reliable production deployments for the system."
      ]
    },
    {
      "title": "Software Engineer - Deloitte",
      "period": "Nov 2023 – Jan 2024",
      "responsibilities": [
        "Assisted in developing an efficient method to handle public transport data from external RESTful APIs using Node.js.",
        "Incorporated user parameters to filter and enable real-time data access and integrate it with the Smarter Roads platform, serving over 30,000 users with seamless transport data insights.",
        "Developed a dynamic map using React and Leaflet library to visualize backend transport data, transforming complex data into intuitive visualizations.",
        "Enhanced accessibility by 35% and enabled users to seamlessly explore bus, tram, and train routes.",
        "Actively participated in Scrum and Agile processes, collaborating with cross-functional teams to deliver iterative solutions on time.",
        "Fostered a culture of continuous improvement and adaptability while meeting project goals and client needs in a fast-paced environment."
      ]
    },
    {
      "title": "Research Assistant - The University of Adelaide",
      "period": "Nov 2023 – Jan 2024",
      "responsibilities": [
        "Accelerated lamb production planning time by 40% by designing a logic cut tree algorithm in Python to optimize meat cutting patterns.",
        "Boosted production profits by 25% by developing a constraint generation algorithm that converts cut tree structures into optimized cutting patterns for minimizing waste.",
        "Increased operational efficiency by 35% by implementing an Integer Linear Programming (ILP) optimization model that automates cutting sequence decisions based on product specifications.",
        "Collaborated with researchers to provide training and support that sped up onboarding by 25%, promoting knowledge-sharing and teamwork."
      ]
    },
    {
      "title": "Software Engineer - Vietnam Posts and Telecommunications Group (VNPT)",
      "period": "Nov 2022 – Mar 2023",
      "responsibilities": [
        "Collaborated with cross-functional teams to develop and optimize the UI for displaying customer behavior insights (Social Class, Relationship Prediction, Air Travel) in the CUSTOMER 360 project using ReactJS and Redux.",
        "Worked closely with backend teams to integrate APIs and synchronize real-time data, streamlining the flow of customer insights and enabling more accurate, data-driven decisions.",
        "Contributed to optimizing the React.js codebase through code splitting and lazy loading, reducing page load time by 30% and enhancing system performance.",
        "Played a key role in designing an intuitive dashboard and adjusting multi-dimensional network-wide views using D3.js and Chart.js, making complex data accessible and actionable for non-technical users.",
        "Worked collaboratively in an agile environment using JIRA and Git workflow with project managers and cross-functional team to meet deadlines, resolve challenges, and deliver high-quality software solutions."
      ]
    }
  ],
  "referees": [],
  "templateId": "Andrew_Nguyen_template_2025-06-05T06-11-43-635Z_04643be8.json",
  "candidateName": "Andrew Nguyen",
  "originalFileName": "Demo_8.pdf",
  "createdAt": "2025-06-05T06:11:43.636Z",
  "updatedAt": "2025-06-05T06:11:43.636Z",
  "isTemplate": true,
  "type": "resume-template"
}