{
  "profile": {
    "name": "Andrew Nguyen",
    "title": "Software Engineer",
    "location": "Adelaide, SA",
    "clearance": "",
    "photo": "/api/placeholder/400/600",
    "description": "Highly accomplished and results-oriented Full-Stack Software Engineer with 2+ years of experience in designing, developing, and deploying scalable and data-driven applications. Proven ability to collaborate effectively with cross-functional teams, leverage cutting-edge technologies like React, Node.js, and Python, and deliver impactful solutions that exceed client expectations.  Adept at streamlining workflows, optimizing performance, and enhancing user experiences, consistently exceeding targets and delivering significant improvements in efficiency and engagement.  Expertise in front-end frameworks (React, React Native, Angular), back-end technologies (Express.js, .NET), databases (MySQL, PostgreSQL, MongoDB), and cloud platforms (AWS).  Seeking a challenging Software Engineer role at Unifacta Pty Ltd to contribute to the development of innovative software solutions and leverage my skills in a collaborative and dynamic environment. My experience in building data-driven applications, optimizing performance, and delivering intuitive user experiences aligns perfectly with Unifacta's focus on cutting-edge technology and business success.",
    "description2": "My passion for software engineering and commitment to continuous learning are evident in my diverse portfolio of projects and contributions to high-profile organizations.  I thrive in fast-paced environments, readily adapt to new technologies, and consistently exceed expectations.  My proven ability to translate complex technical concepts into clear and concise communication, coupled with my strong problem-solving skills and collaborative spirit, make me an ideal candidate for Unifacta's team. I am confident in my ability to quickly integrate into your team and make significant contributions to your ongoing projects.  My proactive approach and dedication to delivering high-quality solutions align perfectly with Unifacta's innovative and collaborative work culture. I am eager to contribute my expertise to Unifacta's mission of delivering cutting-edge technology that drives business success and transforms the way clients operate.  I am particularly excited by the opportunity to work closely with experienced professionals and contribute to the growth and success of a small, dedicated team."
  },
  "qualifications": [
    "Bachelor of Computer Science, The University of Adelaide"
  ],
  "affiliations": [
    "Professional memberships information not available"
  ],
  "skills": [
    "React/React Native",
    "Node.js/.NET",
    "Python",
    "JavaScript/TypeScript",
    "MySQL/PostgreSQL/MongoDB",
    "AWS (S3, RDS, EC2)",
    "Agile/Scrum",
    "Problem-solving/Communication"
  ],
  "keyAchievements": [
    "Streamlined outreach workflows by 60% and improved client engagement rates by 25% through a data-driven prospecting system (UPP Global Technology JSC)",
    "Reduced page load time by 30% through code splitting and lazy loading in React.js (VNPT)",
    "Accelerated lamb production planning time by 40% by designing a logic cut tree algorithm in Python (University of Adelaide)"
  ],
  "experience": [
    {
      "title": "Software Engineer - UPP Global Technology JSC (Remote)",
      "period": "Jan 2025 – March 2025",
      "responsibilities": [
        "Collaborated with a team of two to deliver a data-driven prospecting system that automated client discovery, streamlining outreach workflows by 60% and improving client engagement rates by 25%.",
        "Developed an intelligent automation system using Python to extract and process over 500 qualified sales leads, reducing manual data entry time by 100%.",
        "Engineered a resilient automation framework with bot detection bypass mechanisms and API integration to Salesforce Sales Cloud, enhancing lead generation workflow."
      ]
    },
    {
      "title": "Software Engineer - Deloitte (Adelaide, SA)",
      "period": "Nov 2023 – Jan 2024",
      "responsibilities": [
        "Developed an efficient method to handle public transport data from external RESTful APIs using Node.js, serving over 30,000 users with seamless transport data insights.",
        "Developed a dynamic map using React and Leaflet to visualize backend transport data, enhancing accessibility by 35% and enabling users to seamlessly explore transport routes.",
        "Actively participated in Scrum and Agile processes, collaborating with cross-functional teams to deliver iterative solutions on time."
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Software Engineer - UPP Global Technology JSC (Remote)",
      "period": "Jan 2025 – March 2025",
      "responsibilities": [
        "Collaborated in a team of two under senior mentorship, working closely with different sales teams to deliver a data-driven prospecting system that automated client discovery, streamlined outreach workflows by 60%, and improved client engagement rates by 25%.",
        "Developed an intelligent automation system using Python and custom network request capture techniques to extract and process over 500 qualified sales leads from an external platform.",
        "Engineered a resilient automation framework with bot detection bypass mechanisms and API integration to Salesforce Sales Cloud, reducing manual data entry time by 100% and enhancing lead generation workflow.",
        "Assisted in building continuous integration/deployment processes using GitLab CI/CD, enabling automated testing and reliable production deployments for the system."
      ]
    },
    {
      "title": "Software Engineer - Deloitte (Adelaide, SA)",
      "period": "Nov 2023 – Jan 2024",
      "responsibilities": [
        "Assisted in developing an efficient method to handle public transport data from external RESTful APIs using Node.js, incorporating user parameters to filter and enable real-time data access and integrate it with the Smarter Roads platform, serving over 30,000 users with seamless transport data insights.",
        "Developed a dynamic map using React and Leaflet library to visualize backend transport data that transforms complex data into intuitive visualizations, enhancing accessibility by 35%, and enabling users to seamlessly explore bus, tram, and train routes.",
        "Actively participated in Scrum and Agile processes, collaborating with cross-functional teams to deliver iterative solutions on time, fostering a culture of continuous improvement and adaptability while meeting project goals and client needs in a fast-paced environment."
      ]
    },
    {
      "title": "Research Assistant - The University of Adelaide (Adelaide, SA)",
      "period": "Nov 2023 – Jan 2024",
      "responsibilities": [
        "Accelerated lamb production planning time by 40% by designing a logic cut tree algorithm in Python to optimize meat cutting patterns.",
        "Boosted production profits by 25% by developing a constraint generation algorithm that converts cut tree structures into optimized cutting patterns for minimizing waste.",
        "Increased operational efficiency by 35% by implementing an Integer Linear Programming (ILP) optimization model that automates cutting sequence decisions based on product specifications.",
        "Collaborated with researchers to provide training and support that sped up onboarding by 25%, while promoting knowledge-sharing and teamwork to ensure smooth integration and sustainable impact on the production process."
      ]
    },
    {
      "title": "Software Engineer - Vietnam Posts and Telecommunications Group (VNPT) (Ha Noi, Viet Nam)",
      "period": "Nov 2022 – Mar 2023",
      "responsibilities": [
        "Collaborated with cross-functional teams to develop and optimize the UI for displaying customer behavior insights (Social Class, Relationship Prediction, Air Travel) in the CUSTOMER 360 project using ReactJS and Redux, ensuring a seamless, user-friendly experience across the platform.",
        "Worked closely with backend teams to integrate APIs and synchronize real-time data, streamlining the flow of customer insights and enabling more accurate, data-driven decisions.",
        "Contributed to optimizing the React.js codebase through code splitting and lazy loading, reducing page load time by 30%, and enhancing system performance—ensuring that both the technical team and end-users experienced smooth and efficient interaction with the platform.",
        "Played a key role in designing an intuitive dashboard and adjusting multi-dimensional network-wide views using D3.js and Chart.js, making complex data accessible and actionable for non-technical users and improving decision-making processes.",
        "Worked collaboratively in an agile environment using JIRA and Git workflow with project managers and cross-functional team to meet deadlines, resolve challenges, and deliver high-quality software solutions that contributed directly to the success of the project."
      ]
    }
  ],
  "referees": [],
  "templateId": "Andrew_Nguyen_template_2025-06-05T07-54-32-187Z_56df3cba.json",
  "candidateName": "Andrew Nguyen",
  "originalFileName": "Demo_8.pdf",
  "createdAt": "2025-06-05T07:54:32.188Z",
  "updatedAt": "2025-06-05T07:54:32.188Z",
  "isTemplate": true,
  "type": "resume-template"
}