{
  "profile": {
    "name": "Kara James",
    "title": "GROUP RISK LEAD",
    "location": "Jerrabomberra, NSW",
    "clearance": "Australian Government NV1 Security Clearance",
    "photo": "/uploads/profile-pictures/fdc6986d-2d32-4ac8-9402-722842383038.jpg",
    "description": "Results-driven Risk Management professional with over 15 years of experience in delivering governance, risk, and compliance solutions across diverse sectors, including defence, education, and infrastructure.  Possessing a Juris Doctor and a Master of Information Systems (Project Management), Kara has a proven track record in enterprise-wide risk management frameworks, strategic risk assessments, and regulatory compliance for high-impact projects exceeding $200M.  Her expertise extends to managing stakeholder relationships, implementing predictive analytics tools, and ensuring project efficiency.  Kara's experience in navigating complex regulatory landscapes and delivering successful outcomes for government clients makes her a highly suitable candidate for roles requiring strategic risk management and compliance expertise.  She consistently demonstrates the ability to reduce risk exposure and drive significant business growth through proactive mitigation strategies and innovative risk management frameworks.  Her background in law and information systems provides a unique blend of skills and perspectives, allowing her to effectively address complex challenges and deliver impactful solutions.",
    "description2": "Kara's career showcases a progressive trajectory in risk management, consistently exceeding expectations and delivering quantifiable results.  She has spearheaded enterprise risk management frameworks, resulting in a 50% reduction in risk exposure and driving $120M in business growth.  Her experience encompasses the design and implementation of risk management strategies for high-impact projects, the introduction of predictive analytics tools to reduce project delays and cost overruns, and the management of vendor and contract risks.  Kara's ability to integrate risk management principles into operational frameworks, coupled with her strong stakeholder management skills, ensures seamless collaboration and successful project delivery.  Her commitment to regulatory compliance and emergency preparedness protocols, combined with her proven ability to manage high-value programs with zero regulatory breaches, makes her an ideal candidate for organizations seeking a highly skilled and experienced risk management professional."
  },
  "qualifications": [
    "Juris Doctor of Law (2025) - University of Sydney",
    "Master of Information Systems (Project Management) (2011) - UNSW",
    "Master of International Relations (2010) - University of Queensland",
    "Bachelor of Engineering in Information Technology (Computer Science) (2007)",
    "Qualified Integrated Management Systems Lead Auditor (CISA)"
  ],
  "affiliations": [
    "Information not available"
  ],
  "skills": [
    "Enterprise Risk Management (ERM) Frameworks",
    "Stakeholder Engagement & Management",
    "Risk Identification, Mitigation, and Reporting",
    "Regulatory Compliance & Audit Coordination",
    "Predictive Analytics",
    "Incident Management & Business Continuity Planning",
    "Vendor & Contract Risk Management",
    "Project Management"
  ],
  "keyAchievements": [
    "Reduced risk exposure by 50% through innovative enterprise risk management frameworks.",
    "Drove $120M business growth via strategic risk assessments and proactive mitigation strategies.",
    "Managed risk and compliance for high-value programs exceeding $200M with zero regulatory breaches."
  ],
  "experience": [
    {
      "title": "Group Risk Lead - Leidos Australia (Defence Digital Modernisation)",
      "period": "AUG 2023 - Till date",
      "responsibilities": [
        "Spearheaded enterprise risk management frameworks, reducing risk exposure by 50%",
        "Conducted strategic risk assessments, driving $120M business growth",
        "Developed cross-functional risk integration strategies",
        "Ensured compliance with government regulations"
      ]
    },
    {
      "title": "Senior Manager - Leidos Australia (Defence Digital Solutions & Support)",
      "period": "MAY 2022 - AUG 2023",
      "responsibilities": [
        "Designed and implemented risk management strategies for projects exceeding $200M",
        "Introduced predictive analytics tools, reducing project delays and cost overruns by 20%",
        "Managed vendor and contract risks",
        "Enhanced program delivery by integrating risk management principles"
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Group Risk Lead - Leidos Australia (Defence Digital Modernisation)",
      "period": "AUG 2023 - Till date",
      "responsibilities": [
        "Spearheaded enterprise risk management frameworks aligned with organizational objectives, reducing risk exposure by 50%.",
        "Conducted strategic risk assessments for partnerships and expansions, driving business growth by $120M in a single year.",
        "Developed cross-functional risk integration strategies, embedding proactive risk management across teams.",
        "Ensured compliance with government regulations and aligned risk strategies with emergency preparedness protocols.",
        "Partnered with senior leadership to maintain regulatory adherence and support strategic initiatives."
      ]
    },
    {
      "title": "Senior Manager - Leidos Australia (Defence Digital Solutions & Support)",
      "period": "MAY 2022 - AUG 2023",
      "responsibilities": [
        "Designed and implemented risk management strategies for high-impact projects exceeding $200M.",
        "Introduced predictive analytics tools, reducing project delays and cost overruns by 20%.",
        "Managed vendor and contract risks, ensuring compliance with organizational policies.",
        "Enhanced program delivery by integrating risk management principles into operational frameworks."
      ]
    },
    {
      "title": "Program Manager - Department of Education (Teaching Quality and Impact Directorate)",
      "period": "DEC 2020 - May 2022",
      "responsibilities": [
        "Directed comprehensive risk management processes across six Quality Teaching Practice Program projects, ensuring adherence to regulatory and funding requirements.",
        "Developed and maintained detailed project plans, including budgets, resource allocation, and risk mitigation strategies, to deliver programs within agreed timelines.",
        "Facilitated high-impact workshops and stakeholder meetings, driving alignment on key deliverables and ensuring seamless collaboration among diverse teams."
      ]
    },
    {
      "title": "Governance, Risk and Compliance Manager - PricewaterhouseCoopers",
      "period": "NOV 2019 - JUNE 2020",
      "responsibilities": [
        "Delivered governance and risk frameworks for high-profile government clients, driving process improvements and ensuring alignment with business needs.",
        "Conducted compliance reviews and risk assessments, enhancing policy effectiveness and identifying control issues with actionable management plans.",
        "Designed and developed training programs and content (e.g., PowerPoint, Jamboard) to promote organizational understanding of risk and compliance principles.",
        "Managed multi-client engagements, overseeing project planning, financials, reporting, and stakeholder communication.",
        "Supported Risk Partners by delivering strategic and BAU changes through process mapping, architecture reviews, and performance improvement challenges.",
        "Directed fieldwork progress, ensured deliverable quality, and contributed to final reporting, managing team performance effectively.",
        "Determined organizational risk profiles using RACM, defined roles and responsibilities (RACI), and developed robust risk policy and framework documentation."
      ]
    },
    {
      "title": "Governance, Risk and Conduct Advisory – Senior Analyst - Deloitte Touche Tohmatsu Services, Inc.",
      "period": "JUL 2018 - OCT 2019",
      "responsibilities": [
        "Delivered outcomes for the Royal Commission into Misconduct in Banking and Financial Services, meeting strict weekly deadlines.",
        "Provided advisory services to implement a single operational risk and compliance system, establishing an effective incident management framework.",
        "Delivered risk reporting to oversee remediation activities, enhance governance, and ensure adherence to regulatory requirements for ASIC AFSL holders.",
        "Reviewed and challenged key controls to minimize future losses and updated department policies and processes.",
        "Supported the development of assessment models, data collection, and compensation methodologies, documented in Business Requirements documents.",
        "Managed 20+ team members, including SMEs and digital content experts, overseeing project planning, budgeting, resource allocation, and financial reporting.",
        "Led the implementation and governance of complex customer complaint and redress exercises, mitigating risks and ensuring compliance.",
        "Executed initiatives to mature and embed the risk and compliance framework, automating processes and delivering the annual compliance work plan."
      ]
    },
    {
      "title": "Regulatory Compliance Specialist - TAFE - NSW (Corporate Governance, Risk & Compliance)",
      "period": "JUN 2017 - JUL 2018",
      "responsibilities": [
        "Coordinated several high-risk government projects, from initial planning to delivery and implementation.",
        "Planned, scheduled, and communicated project needs with key internal and external stakeholders.",
        "Completed a major data migration project involving HPCM with strict timelines using an agile approach.",
        "Served as a stakeholder and lead on projects crucial for TAFE’s merger of 11 regions into one TAFE NSW.",
        "Possessed high-level knowledge of regulatory bodies (ASQA, TEQSA) and standards.",
        "Led third-party contract management with external organizations partnering with TAFE.",
        "Worked with external regulatory bodies (SAFEWORK, RMS NSW) for high-risk qualifications."
      ]
    },
    {
      "title": "Compliance and Policy Analyst - Codecamp Pty Ltd",
      "period": "MAR 2016 - MAR 2017",
      "responsibilities": [
        "Managed business compliance with policies, procedures, and government requirements.",
        "Served as the first point of contact for government compliance matters.",
        "Successfully obtained compliance approvals from state and federal government within 6 months.",
        "Provided advice and support on risk matters and policies to enable crucial business decisions."
      ]
    },
    {
      "title": "Operations Compliance Analyst - Study Group International",
      "period": "JAN 2012 - JAN 2015",
      "responsibilities": [
        "Ensured business compliance with ASQA and the VET Quality Framework.",
        "Led quarterly audits, ensuring compliance and maintaining annual legal registrations.",
        "Successfully conducted and passed 8 audits in 2 years with zero non-compliance.",
        "Served as the main liaison for integrating business systems across educational technologies.",
        "Possessed expert-level understanding of various Learning Management Systems, Student Management Systems & Business Systems.",
        "Implemented new learning systems by providing reference data within business systems.",
        "Resolved business user issues by communicating with necessary teams.",
        "Liaised with the Compliance Director for developing ASQA-compliant documents and implementing policies."
      ]
    },
    {
      "title": "Associate Programmer (Developer) - Accenture",
      "period": "JUN 2007 - JUN 2009",
      "responsibilities": [
        "Responsible for all stages of the project lifecycle, from Business Case development to post-implementation support.",
        "Managed stakeholders across Development, Testing, and Environment teams.",
        "Oversaw software testing and end-to-end progress setup to meet client requirements.",
        "Provided governance support during various IT phases."
      ]
    }
  ],
  "referees": [],
  "templateId": "Kara_James_template_2025-06-03T06-15-16-148Z_7aacd06d.json",
  "candidateName": "Kara James",
  "originalFileName": "Demo_3.pdf",
  "createdAt": "2025-06-03T06:15:16.149Z",
  "updatedAt": "2025-06-03T06:15:16.149Z",
  "isTemplate": true,
  "type": "resume-template"
}