{
  "profile": {
    "name": "Leonardo Perez",
    "title": "DYNAMIC IT PROFESSIONAL",
    "location": "Sydney",
    "clearance": "Unspecified security clearance",
    "photo": "/api/placeholder/400/600",
    "description": "Leonardo Perez is a dynamic IT professional with over 20 years of experience, including 10+ years in Delivery Management.  His expertise lies in leading complex, cross-functional teams across diverse industries to deliver high-impact solutions aligned with business strategies.  A Certified Project Management Professional (PMP), Leonardo consistently exceeds project goals, enhances customer satisfaction, and adheres to strict timelines and budgets.  His extensive experience in Agile methodologies, spanning over a decade, encompasses facilitating Scrum ceremonies, managing project dependencies, and ensuring the successful execution of Salesforce implementations tailored to specific business needs.  His background as a Software Engineering teacher at Buenos Aires University provides valuable insights into educational methodologies and fosters a culture of continuous learning and development within his teams.  He is recognised for his ability to foster strong team collaboration, creating positive and results-oriented environments that cultivate high performance and client satisfaction.  His leadership extends to global IT projects, including ERP implementations, Salesforce transformations, and hardware service delivery initiatives spanning 120+ countries.",
    "description2": "Leonardo's career showcases a consistent record of successful project delivery and leadership across various sectors.  He has spearheaded the standardization of resource planning protocols and implemented comprehensive Ways of Working (WoW) standards, resulting in enhanced project efficiency and alignment.  His expertise in Salesforce implementations is evident in his successful delivery of Salesforce Health Cloud for Cochlear Ltd, leading to improved customer experience and enhanced sales outcomes.  He has also successfully led the rollout of Agile methodologies across the Asia Pacific region, significantly reducing lead times and enhancing delivery efficiency.  His ability to manage complex projects, navigate technical challenges, and foster strong stakeholder relationships makes him a highly effective and sought-after leader in the IT industry.  He consistently demonstrates a commitment to continuous improvement, actively participating in knowledge sharing and mentoring team members to achieve optimal project outcomes and foster a culture of innovation."
  },
  "qualifications": [
    "Master of Business Management and Organisation, School of Engineering, University of Buenos Aires, Argentina",
    "Computer Science B.Sc. Degree, School of Engineering, University of Buenos Aires, Argentina (Accredited by The Australian Computer Society as equivalent to the Australian Degree of Software Engineering or Computer Science)",
    "Certified Scrum Product Owner (Scrum Alliance)",
    "Prince2 Practitioner (Axelos PeopleCert)",
    "Prince2 Agile Practitioner (Axelos PeopleCert)",
    "Agile Project Manager Practitioner (APMG International)",
    "ITIL® V3 Foundation Cert in IT Service Management",
    "IBM Agile",
    "IBM Project Manager"
  ],
  "affiliations": [
    "Information not available"
  ],
  "skills": [
    "Agile Methodologies/Scrum",
    "Salesforce Implementation",
    "Project Management",
    "Stakeholder Management",
    "Team Leadership",
    "Resource Planning",
    "Risk Management",
    "API Integration"
  ],
  "keyAchievements": [
    "Spearheaded the standardization of resource planning protocols and implemented comprehensive Ways of Working (WoW) standards at Torrens University, resulting in enhanced project efficiency and alignment across teams.",
    "Successfully managed the delivery of Salesforce Health Cloud implementation at Cochlear Ltd, improving customer experience and streamlining processes; led Sales squads to achieve the first successful API integration within the program.",
    "Championed the rollout of Agile methodologies across the Asia Pacific region at IBM Australia, significantly reducing lead time and enhancing delivery efficiency; served as the Asia Pacific Lead for a global Salesforce implementation."
  ],
  "experience": [
    {
      "title": "Delivery Manager - Torrens University",
      "period": "Oct 2023 – Present",
      "responsibilities": [
        "Established standardized resource planning protocols and implemented WoW standards, enhancing project efficiency.",
        "Successfully guided significant project initiation and execution, ensuring compliance.",
        "Collaborated with stakeholders to define project scope, goals, and deliverables, fostering strong team collaboration."
      ]
    },
    {
      "title": "Delivery Manager, Scrum Master - Cochlear Ltd",
      "period": "Jul 2021 – Sep 2023",
      "responsibilities": [
        "Managed successful Salesforce Health Cloud implementation, improving customer experience.",
        "Led Sales squads to achieve the first successful API integration within the program.",
        "Proactively managed scope changes and devised contingency plans, mitigating risks."
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Delivery Manager - Torrens University",
      "period": "Oct 2023 – Present",
      "responsibilities": [
        "Established standardized resource planning protocols and implemented comprehensive Ways of Working (WoW) standards, enhancing project efficiency and alignment across teams.",
        "Successfully guided the initiation and execution of significant projects, ensuring adherence to compliance processes and timely delivery of high-quality solutions.",
        "Collaborated with stakeholders to define project scope, goals, and deliverables, facilitating effective communication and fostering strong team collaboration.",
        "Implemented compliance processes and maintained up-to-date knowledge in this area.",
        "Researched and presented well-supported solution options aligned with corporate strategy in Business Cases.",
        "Estimated resource requirements for project goals.",
        "Identified and managed project dependencies and critical path.",
        "Identified, managed, and escalated risks and issues."
      ]
    },
    {
      "title": "Delivery Manager, Scrum Master - Cochlear Ltd",
      "period": "Jul 2021 – Sep 2023",
      "responsibilities": [
        "Managed the successful delivery of Salesforce Health Cloud implementation, focusing on Sales and Marketing business streams, resulting in improved customer experience and streamlined processes.",
        "Led Sales squads to achieve the first successful completion of API integration work within the program, effectively addressing technical challenges and ensuring project milestones were met.",
        "Proactively managed changes in project scope and devised contingency plans for potential issues, mitigating risks and ensuring project success.",
        "Engaged in active participation within the Delivery Management Guild, contributing to the sharing of best Agile delivery practices.",
        "Worked closely with agile delivery teams, Product Owners & Stakeholders (Squads & SMEs) to produce project plans and execute end-to-end delivery of assigned Initiatives (for services and products).",
        "Coordinated backlog refinement meetings to address architectural and technical design aspects with architects and developers.",
        "Managed vendors (Salesforce Inc., Capgemini, Epam, internal Salesforce vendor).",
        "Resolved issues/blockers impacting the achievement of team sprint commitments."
      ]
    },
    {
      "title": "Agile Project Manager - IBM Australia",
      "period": "Jan 2014 – Jun 2021",
      "responsibilities": [
        "Successfully led multiple Salesforce deployments across the Asia Pacific region, ensuring seamless integration with business goals; key in transitioning from legacy systems to Salesforce cloud solutions, enhancing customer support.",
        "Championed the rollout of Agile methodologies across the Asia Pacific region, significantly reducing lead time and enhancing delivery efficiency; served as the Asia Pacific Lead for a global Salesforce implementation.",
        "Coached and supported cross-functional teams through implementation, ensuring solutions met user needs and adhered to project timelines and budget constraints.",
        "Guided development teams in business requirements management, prioritising backlog items, monitoring progress, and resolving obstacles.",
        "Mentored Agile adoption, fostering self-directed teams, implementing collaboration tools, and elevating Agile maturity.",
        "Ensured Hardware Service Delivery Portfolio senior team's familiarity with Agile practices.",
        "Demonstrated consistent innovation in solving business or technical challenges and received multiple Manager's awards.",
        "Implemented software projects using Agile methodologies within the SDLC, consistently delivering high-quality results."
      ]
    },
    {
      "title": "Project Manager - IBM Australia",
      "period": "Jan 2011 – Jun 2013",
      "responsibilities": [
        "Conducted a thorough review of the existing strategic roadmap, exploring alternative options to minimise adverse effects on expected delivery while continuously delivering value to the business.",
        "Expanded role as Product Owner for Entitlement and Data-Warehouse applications.",
        "Restructured Development Teams, resulting in a fivefold increase in projects delivered per year within budget constraints.",
        "Championed a compliance process simplification initiative, resulting in a 25% productivity improvement and reduced lead time between releases.",
        "Built effective working relationships with geographically diverse business stakeholders at all levels.",
        "Developed comprehensive project plans, including scope, timeline, and resource allocation.",
        "Identified and engaged with key stakeholders, including internal clients, teams, and senior management.",
        "Regularly reported overall project status to management and key stakeholders, and escalated major risks/blockers as necessary."
      ]
    }
  ],
  "referees": [
    {
      "name": "Name not provided",
      "title": "Title not provided",
      "email": "Email not provided",
      "phone": "Phone not provided"
    }
  ],
  "templateId": "Leonardo_Perez_template_2025-06-02T09-45-42-203Z_6ec00a4c.json",
  "candidateName": "Leonardo Perez",
  "originalFileName": "Leonardo_Perez_Resume.pdf",
  "createdAt": "2025-06-02T09:45:42.203Z",
  "updatedAt": "2025-06-02T09:45:42.203Z",
  "isTemplate": true,
  "type": "resume-template"
}