{
  "profile": {
    "name": "Rick Spence",
    "title": "PROGRAM/PROJECT MANAGER",
    "location": "Canberra",
    "clearance": "NV2 & AFP NV1",
    "photo": "/uploads/profile-pictures/e9330dc1-8cb3-446f-bf60-b92f9dd974cb.jpg",
    "description": "Rick Spence is a highly accomplished and results-oriented Program/Project Manager with extensive experience in leading and delivering complex projects and programs within the Australian Defence Force and various government agencies.  His expertise spans end-to-end project management, risk mitigation, milestone achievement, and resource coordination.  A highly organized and detail-oriented leader, Rick possesses exceptional communication and negotiation skills, effectively collaborating with internal teams, vendors, and stakeholders.  His proven ability to manage multiple teams, mentor junior staff, and implement Agile methodologies (SAFe 6.0) demonstrates his leadership capabilities and commitment to delivering exceptional results.  Rick's experience includes successful digital transformations, cloud migration projects (Azure and AWS), and the development and implementation of PMO frameworks. He consistently exceeds expectations, delivering projects on time and within budget, while fostering a collaborative and high-performing team environment.",
    "description2": "Rick's career showcases a consistent track record of success in navigating challenging projects and programs, consistently delivering exceptional results.  He has a deep understanding of Agile methodologies, including SAFe, Scrum, and PRINCE2, and effectively applies these frameworks to optimize project delivery.  His experience encompasses various project lifecycles, from initiation and planning to execution, monitoring, and closure.  Rick's expertise extends to stakeholder management, risk assessment, and change management, ensuring seamless project transitions and stakeholder satisfaction.  He is adept at leveraging technology and tools such as Jira, Confluence, and Power BI to enhance project visibility and efficiency.  His ambition and commitment to continuous improvement make him a valuable asset to any organization seeking a highly skilled and experienced Program/Project Manager."
  },
  "qualifications": [
    "Certified SAFe Practitioner",
    "P3M framework",
    "MSP (Managing Successful projects/programs)",
    "IT Project Management, PMP PMBOK",
    "Project management leadership & communication",
    "PRINCE2 & Scrum Agile (Axelos)",
    "ITIL"
  ],
  "affiliations": [
    "LACE Member",
    "SAFe Studio Member"
  ],
  "skills": [
    "Program Management",
    "Project Management",
    "Scrum Master",
    "Agile Methodologies/SAFe",
    "Microsoft Azure",
    "AWS",
    "Jira/Confluence",
    "Cyber Security"
  ],
  "keyAchievements": [
    "Successfully implemented SAFe 6.0 for the DSE Program (JP9111, DEF2222, JP2181), optimizing Jira and Confluence and developing LACE Teams governance.",
    "Created a chargeback system for Services Australia generating income streams from work done for DSS, NDIA, and DVA.",
    "Successfully rescued a failing project for DSS, uplifting their network to PROTECTED, demonstrating strong problem-solving skills."
  ],
  "experience": [
    {
      "title": "Principal Consultant - Jigsaw Notions (PgO Business Transformation Team)",
      "period": "March 2024 - Present",
      "responsibilities": [
        "Served as RTE, Agile Coach, Scrum Master, and LACE member for Department of Defense projects.",
        "Managed up to 9 teams comprising engineers, testers, developers, and cybersecurity professionals.",
        "Mentored 6 project support officers/Scrum Masters.",
        "Managed Jira boards and acted as Jira client-side admin for multiple projects."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - Department of Industry and Science (Cloud Platforms)",
      "period": "November 2023 - January 2024",
      "responsibilities": [
        "Identified improvements for the Microsoft Azure Cloud Platforms Team to enhance their performance in 2024.",
        "Organized their DevOps environment, ensuring data documentation.",
        "Built their first PowerBI dashboard and provided guidance to fellow cloud PMs.",
        "Managed the \"Tech Readiness\" project for Microsoft Co-Pilot."
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Principal Consultant - Jigsaw Notions (PgO Business Transformation Team)",
      "period": "March 2024 - Present",
      "responsibilities": [
        "Served as RTE, Agile Coach, Scrum Master, and LACE member for Department of Defense projects JP9111, DEF2222, and the PMO for the Digital Transformation program.",
        "Managed up to 9 teams (engineers, testers, developers, technical writers, cybersecurity teams).",
        "Managed/supported/mentored 6 project support officers/Scrum Masters.",
        "Consulted on, created, and configured all Jira boards; served as JP9111, DEF2222, and JP2181 Jira client-side admin.",
        "Coached PSOs on becoming Scrum Masters and Scrum Masters on skill development.",
        "Coached team members (APS/ADF/Contractors) on PI/ART events, Agile practices, and Jira.",
        "Worked with JP9111 & DEF2222 as the product manager.",
        "Provided clarity/direction/execution on DDG ways of working and Agile best practices for JP9111 and DEF2222."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - Department of Industry and Science (Cloud Platforms)",
      "period": "November 2023 - January 2024",
      "responsibilities": [
        "Worked within the Microsoft Azure Cloud Platforms Team to identify improvements for 2024.",
        "Organized their DevOps environment, documenting all necessary data.",
        "Built their first PowerBI dashboard to display key DevOps information.",
        "Provided guidance to fellow cloud PMs on projects, governance, and best practices.",
        "Managed their \"Tech Readiness\" project for Microsoft Co-Pilot in conjunction with the DTA."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - CSIRO",
      "period": "December 2022 - November 2023",
      "responsibilities": [
        "Served as Product Owner and project manager for Data Stewards and Software Coding projects.",
        "Implemented data management practices and industry-standard software coding/repository frameworks within Microsoft Azure.",
        "Leveraged digital library, cybersecurity, and training teams for staff training.",
        "Uplifted the cybersecurity maturity level within the projects.",
        "Created the first PM mentorship program.",
        "Collaborated with CSIRO executives on building their PMO."
      ]
    },
    {
      "title": "Senior Consultant - Jacobs Australia (DDG, Department of Defense)",
      "period": "July 2022 - November 2022",
      "responsibilities": [
        "Cleared a backlog of over 120 projects as part of the PMO, analyzing in-flight projects against the gates process.",
        "Worked with the executive team to hire 3 PMs, BAs, and engineers.",
        "Structured the program and budget for board approval.",
        "Created a SAFe methodology framework tailored for the department."
      ]
    },
    {
      "title": "Senior Strategic Program Manager - Department of Defense (SOMIIC)",
      "period": "May 2022 - July 2022",
      "responsibilities": [
        "Re-established alignment within the SOMIIC team and stakeholder connections.",
        "Built and delivered a project/portfolio framework.",
        "Managed budgets up to billions of dollars across the Australian Defence Force.",
        "Managed the build-out of ServiceNow along the SAFe model."
      ]
    },
    {
      "title": "Senior Strategic Program Manager - The Architecture Practice (TAP) (Department of Defense, Dept. Aged Care)",
      "period": "November 2021 - May 2022",
      "responsibilities": [
        "Collaborated with TAP ICT solution architects and partners (Infosys, Manpower, software vendors).",
        "Interviewed stakeholders to analyze current state, frustrations, and future plans.",
        "Developed a thorough analysis, recommendations, and roadmap within Microsoft Azure.",
        "Guided the Defense cyber team through their iRAP process.",
        "Shaped the scheduling and financial aspects of the ADF recompete bid (valued at $2.1 billion)."
      ]
    },
    {
      "title": "Senior Consultant - Projects Assured (Services Australia, NDIA, DSS, DVA)",
      "period": "November 2020 - November 2021",
      "responsibilities": [
        "Created a Digital Transformation and Data Management program of work within the PMO.",
        "Managed 6 internal work streams, 4 agencies, Microsoft, contractors, and vendors in Microsoft Azure.",
        "Created a chargeback system for Services Australia, generating revenue.",
        "Successfully delivered a project for DSS, uplifting their network to PROTECTED.",
        "Managed the cyber team to achieve maturity level 2 and develop a future roadmap."
      ]
    },
    {
      "title": "Senior Consultant - Veritec (CDPP, The AEC, The Nine Network)",
      "period": "January 2020 - October 2020",
      "responsibilities": [
        "Managed the upgrade of CDPP’s Mobile Device Management system and network uplift to PROTECTED.",
        "Worked as a member of the PMO.",
        "Managed the Nine Network’s digital transformation from Google to Microsoft Azure."
      ]
    },
    {
      "title": "Program Director - Diversity Array Technologies (DArT) (CIMMYT Mexico, Internal company)",
      "period": "January 2019 - January 2020",
      "responsibilities": [
        "Assessed, recommended changes, and executed plans, while hiring additional staff and managing a major client.",
        "Structured projects, resources, and budgeting, working with major clients.",
        "Trained DArT staff and CIMMYT (Mexico) on Scrum Agile and best practices.",
        "Implemented frameworks for bespoke software development in AWS.",
        "Served as the direct customer-facing delivery manager for CIMMYT, visiting Mexico for on-site work.",
        "Managed framework improvements and updates to service integration and management systems."
      ]
    },
    {
      "title": "Program Director - American Driveline (AAMCO)",
      "period": "January 2017 - January 2019",
      "responsibilities": [
        "Program managed the company’s largest modernization program, turning it from a deficit to a profit.",
        "Built teams that delivered a Digital Modernization and Data Management program in Microsoft Azure.",
        "Created business cases for the automotive point-of-sale system for 750 franchisees.",
        "Traveled extensively, training franchisees in large-scale weekend sessions.",
        "Created a CRM dashboard providing real-time data on job pricing, parts costs, and revenue information."
      ]
    }
  ],
  "referees": [],
  "templateId": "Rick_Spence_template_2025-06-03T07-49-19-777Z_6f8d0b2d.json",
  "candidateName": "Rick Spence",
  "originalFileName": "Demo_1.pdf",
  "createdAt": "2025-06-03T07:49:19.777Z",
  "updatedAt": "2025-06-03T07:49:19.777Z",
  "isTemplate": true,
  "type": "resume-template"
}