{
  "profile": {
    "name": "Rick Spence",
    "title": "Project Manager – Digital Transformation",
    "location": "Canberra",
    "clearance": "NV2 & AFP NV1",
    "photo": "/uploads/profile-pictures/d369c1f2-b3bd-4152-aafb-10b59897c717.jpg",
    "description": "Highly accomplished and results-oriented Project Manager with 8+ years of experience leading complex digital transformation initiatives within government and enterprise environments. Proven ability to deliver large-scale projects on time and within budget, leveraging Agile/Hybrid methodologies to manage cross-functional teams and achieve strategic objectives.  Expertise in stakeholder management, risk mitigation, and the development and implementation of robust project plans, schedules, and resource allocation models.  Adept at utilizing project management tools such as Jira, MS Project, and Confluence to ensure seamless project execution and transparent reporting to C-level stakeholders.  Seeking a challenging 12-month fixed-term contract (with potential for extension) to contribute expertise to HorizonTech's Digital Transformation Program, specifically focusing on system migration, process automation, and CRM integration.",
    "description2": "My experience encompasses end-to-end project delivery, from initial concept and planning through to successful completion and lessons learned.  I have a strong track record of successfully managing multiple workstreams simultaneously, ensuring alignment with strategic roadmaps and compliance requirements.  My proficiency in Agile ceremonies (stand-ups, retrospectives, sprint planning) and experience in developing comprehensive project documentation (PID, WBS, Stakeholder Engagement Plans) ensures efficient and effective project governance.  I am adept at managing vendor relationships, third-party deliverables, and internal team coordination, fostering collaborative environments that drive innovation and achieve exceptional outcomes.  My expertise in cloud platforms (AWS, Azure) and experience with enterprise CRM systems further enhances my suitability for this role.  I am confident in my ability to lead and mentor teams, effectively communicate complex information to diverse stakeholders, and proactively identify and mitigate risks to ensure the successful delivery of HorizonTech's Digital Transformation Program."
  },
  "qualifications": [
    "Certified SAFe 5 Practitioner",
    "MSP (Managing Successful projects/programs)",
    "IT Project Management, PMP PMBOK",
    "PRINCE2",
    "Scrum Agile",
    "ITIL"
  ],
  "affiliations": [
    "LACE Member",
    "SAFe Studio Member"
  ],
  "skills": [
    "Project Management",
    "Program Management",
    "Agile Methodologies (Scrum, SAFe)",
    "Stakeholder Management",
    "Risk Management",
    "Jira/Confluence Administration",
    "Cloud Computing (AWS, Azure)",
    "CRM Integration"
  ],
  "keyAchievements": [
    "Successfully implemented SAFe 6.0 for the DSE Program (JP9111, DEF2222, JP2181), resulting in improved efficiency and collaboration.",
    "Led the development of a LACE 2.0 playbook aligned with SAFe 6.0, providing a standardized framework for project governance.",
    "Organized and optimized Jira and Confluence instances, improving team collaboration and project visibility."
  ],
  "experience": [
    {
      "title": "Principal Consultant - Jigsaw Notions (PgO Business Transformation Team)",
      "period": "March 2024 - Present",
      "responsibilities": [
        "Led end-to-end project delivery across multiple digital transformation programs for the Australian Defence Force.",
        "Managed up to 9 cross-functional teams, including engineers, testers, developers, and cybersecurity specialists.",
        "Mentored 6 project support officers/Scrum Masters, fostering their professional development.",
        "Provided expert consultation and administration for Jira boards across multiple projects."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - Department of Industry and Science (Cloud Platforms)",
      "period": "November 2023 - January 2024",
      "responsibilities": [
        "Identified and implemented improvements to optimize team workflows and prepare for the new year.",
        "Organized their DevOps environment, ensuring comprehensive data documentation.",
        "Built the team's first PowerBI dashboard, enhancing data visualization and project reporting.",
        "Provided guidance to fellow cloud PMs on project governance and best practices."
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Principal Consultant - Jigsaw Notions (PgO Business Transformation Team)",
      "period": "March 2024 - Present",
      "responsibilities": [
        "Served as RTE, Agile Coach, Scrum Master, and LACE member for Department of Defense projects JP9111, DEF2222, and the PMO for the Digital Transformation program.",
        "Managed up to 9 teams (engineers, testers, developers, technical writers, cybersecurity teams).",
        "Mentored and supported 6 project support officers/Scrum Masters.",
        "Managed/configured all Jira boards, acting as Jira client-side admin for JP9111, DEF2222, and JP2181.",
        "Coached PSOs on becoming Scrum Masters and Scrum Masters on advanced skills.",
        "Coached team members (APS/ADF/Contractors) on PI/ART events, Agile practices, and Jira.",
        "Collaborated with JP9111 & DEF2222 as the product manager.",
        "Provided clarity/direction/execution on DDG Agile best practices for JP9111 and DEF2222."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - Department of Industry and Science (Cloud Platforms)",
      "period": "November 2023 - January 2024",
      "responsibilities": [
        "Worked within the Microsoft Azure Cloud Platforms Team to identify improvements for 2024.",
        "Organized their DevOps environment, documenting all necessary data.",
        "Built their first PowerBI dashboard to display key DevOps information.",
        "Guided fellow cloud PMs on projects, governance, and best practices.",
        "Managed their “Tech Readiness” project for Microsoft Co-Pilot with the DTA."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - CSIRO",
      "period": "December 2022 - November 2023",
      "responsibilities": [
        "Served as Product Owner and Project Manager for Data Stewards and Software Coding projects.",
        "Implemented data management practices and software coding frameworks within Microsoft Azure.",
        "Leveraged digital library, cybersecurity, and training teams for staff training.",
        "Uplifted the cybersecurity maturity level within the projects.",
        "Created the company's first PM mentorship program.",
        "Collaborated with CSIRO executives on building their PMO."
      ]
    },
    {
      "title": "Senior Consultant - Jacobs Australia (DDG)",
      "period": "July 2022 - November 2022",
      "responsibilities": [
        "Analyzed over 120 projects as part of the PMO, recommending improvements against the gates process.",
        "Collaborated with the executive team to hire additional PMs, BAs, and engineers.",
        "Structured the program and budget for board approval.",
        "Created a SAFe methodology framework tailored for the department."
      ]
    },
    {
      "title": "Senior Strategic Program Manager - Department of Defense (SOMIIC)",
      "period": "May 2022 - July 2022",
      "responsibilities": [
        "Re-established alignment within the SOMIIC team and stakeholder connections.",
        "Built and delivered a project/portfolio framework.",
        "Managed projects with budgets up to billions of dollars across the Australian Defence Force.",
        "Managed the build-out of ServiceNow using the SAFe model."
      ]
    },
    {
      "title": "Senior Strategic Program Manager - The Architecture Practice (TAP)",
      "period": "November 2021 - May 2022",
      "responsibilities": [
        "Collaborated with TAP ICT solution architects and partners (Infosys, Manpower, software vendors).",
        "Interviewed stakeholders (Dept of Health, Dept of Edu QLD, ADF) to analyze current state, frustrations, and future plans.",
        "Developed a thorough analysis, recommendations, and roadmap within Microsoft Azure.",
        "Guided the Defense cyber team through their iRAP process.",
        "Shaped the scheduling and financial aspects of the ADF recompete bid (AUD 2.1 billion)."
      ]
    },
    {
      "title": "Senior Consultant - Projects Assured",
      "period": "November 2020 - November 2021",
      "responsibilities": [
        "Created a Digital Transformation and Data Management program of work (6 internal workstreams, 4 agencies, Microsoft, contractors, vendors) in Microsoft Azure.",
        "Created a chargeback system for Services Australia, generating income from DSS, NDIA, and DVA work.",
        "Successfully delivered a DSS project to uplift their network to PROTECTED.",
        "Managed the cyber team to achieve maturity level 2 and developed a future roadmap.",
        "Heavy stakeholder management across multiple agencies and vendors."
      ]
    },
    {
      "title": "Senior Consultant - Veritec",
      "period": "January 2020 - October 2020",
      "responsibilities": [
        "Managed the upgrade of CDPP’s Mobile Device Management system and network uplift to PROTECTED.",
        "Served as a member of the PMO.",
        "Managed the Nine Network’s digital transformation from Google to Microsoft Azure."
      ]
    },
    {
      "title": "Program Director - Diversity Array Technologies (DArT)",
      "period": "January 2019 - January 2020",
      "responsibilities": [
        "Assessed, recommended changes, and executed plans, while hiring additional staff and managing a major client as the product owner.",
        "Structured projects, resources, and budgeting for the company and major clients.",
        "Trained DArT staff and CIMMYT (Mexico) on Scrum Agile and best practices for software development in AWS.",
        "Served as the direct customer-facing delivery manager for CIMMYT, visiting Mexico for on-site work.",
        "Managed framework improvements and updates to service integration and management systems."
      ]
    },
    {
      "title": "Program Director - American Driveline (AAMCO)",
      "period": "January 2017 - January 2019",
      "responsibilities": [
        "Program managed the company's largest modernization program, improving its financial status.",
        "Built teams that delivered a Digital Modernization and Data Management program in Microsoft Azure.",
        "Created business cases for the automotive point-of-sale system for 750 franchisees (US & Canada).",
        "Provided extensive training to franchisees throughout the US and Canada.",
        "Created a CRM dashboard providing up-to-date data on job pricing, parts costs, and revenue information."
      ]
    }
  ],
  "referees": [],
  "templateId": "Rick_Spence_template_2025-06-05T06-57-51-278Z_a91aaf5b.json",
  "candidateName": "Rick Spence",
  "originalFileName": "Demo_1.pdf",
  "createdAt": "2025-06-05T06:57:51.278Z",
  "updatedAt": "2025-06-05T06:57:51.278Z",
  "isTemplate": true,
  "type": "resume-template"
}