{
  "profile": {
    "name": "Rick Spence",
    "title": "PROGRAM/PROJECT MANAGER",
    "location": "Canberra",
    "clearance": "NV2 & AFP NV1",
    "photo": "/uploads/profile-pictures/813e00c6-aa87-4249-8f9c-f45dfc65b7c2.jpg",
    "description": "A highly accomplished and results-oriented Program/Project Manager with extensive experience in leading and delivering complex projects and programs within the Australian Defence Force and various government agencies.  Possessing a proven track record of success in end-to-end project management, risk mitigation, milestone achievement, and deliverable management, Rick consistently exceeds expectations by leveraging his expertise in Agile methodologies (Scrum, SAFe), program management frameworks (P3M, MSP, PRINCE2), and ITIL best practices.  His leadership skills are evident in his ability to effectively manage and mentor diverse teams, fostering collaboration and driving innovation.  Rick's strategic thinking, coupled with his strong communication and negotiation skills, enables him to build strong relationships with stakeholders at all levels, ensuring project alignment and successful outcomes.  He is adept at utilizing tools such as Jira, Confluence, and Microsoft Azure to optimize project workflows and enhance team productivity.  His ambition and commitment to achieving company goals make him a valuable asset to any organization.",
    "description2": "Rick's career demonstrates a consistent progression in responsibility and impact, marked by significant achievements in digital transformation, cyber security enhancement, and PMO establishment.  He has successfully implemented SAFe 6.0 frameworks, optimized Jira and Confluence instances, and developed LACE team governance processes.  His contributions extend to building PowerBI dashboards, creating charge-back systems generating revenue streams, and guiding teams through complex processes like iRAP.  Rick's experience encompasses diverse projects, from managing multi-billion dollar defense initiatives to uplifting network security and implementing data management best practices.  His ability to navigate complex organizational structures, manage large budgets, and deliver projects on time and within budget makes him an ideal candidate for challenging and impactful roles.  He is a proactive problem-solver, adept at identifying and mitigating risks, and committed to continuous professional development, as evidenced by his numerous certifications and memberships."
  },
  "qualifications": [
    "Certified SAFe Practitioner",
    "P3M framework",
    "MSP (Managing Successful projects/programs)",
    "IT Project Management, PMP PMBOK",
    "PRINCE2 & Scrum Agile (Axelos)",
    "ITIL"
  ],
  "affiliations": [
    "LACE Member",
    "SAFe Studio Member"
  ],
  "skills": [
    "Program Management",
    "Project Management",
    "Scrum Master",
    "Agile Methodologies/SAFe",
    "Microsoft Azure",
    "Jira/Confluence",
    "Cyber Security",
    "Stakeholder Management"
  ],
  "keyAchievements": [
    "Successfully implemented SAFe 6.0 for the DSE Program (JP9111, DEF2222, JP2181), optimizing processes and improving team collaboration.",
    "Created a charge-back system for Services Australia, generating a revenue stream for work done for DSS, NDIA, and DVA.",
    "Successfully managed the ADF recompete bid, a significant opportunity holding a substantial value of 2.1 billion dollars, shaping the scheduling timeline and financial aspects."
  ],
  "experience": [
    {
      "title": "Principal Consultant - Jigsaw Notions (PgO Business Transformation Team)",
      "period": "March 2024 - Present",
      "responsibilities": [
        "Served as RTE, Agile Coach, Scrum Master, and LACE member for Department of Defense projects.",
        "Managed up to 9 teams comprising engineers, testers, developers, and cybersecurity professionals.",
        "Mentored 6 project support officers/Scrum Masters.",
        "Managed Jira boards and served as Jira client-side admin for multiple projects."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - Department of Industry and Science (Cloud Platforms)",
      "period": "November 2023 - January 2024",
      "responsibilities": [
        "Identified improvements to optimize the Microsoft Azure Cloud Platforms Team's workflow.",
        "Organized their DevOps environment, ensuring all necessary data was documented.",
        "Built their first PowerBI dashboard, providing key insights from DevOps data.",
        "Provided guidance to fellow cloud PMs on projects, governance, and best practices."
      ]
    }
  ],
  "fullExperience": [
    {
      "title": "Principal Consultant - Jigsaw Notions (PgO Business Transformation Team)",
      "period": "March 2024 - Present",
      "responsibilities": [
        "Served as RTE, Agile Coach, Scrum Master, and LACE member for Department of Defense projects JP9111, DEF2222, and the PMO for the Digital Transformation program.",
        "Managed up to 9 teams (engineers, testers, developers, technical writers, and cybersecurity teams).",
        "Managed/supported/mentored 6 project support officers/Scrum Masters.",
        "Consulted on, created, and configured all Jira boards, acting as Jira client-side admin for JP9111, DEF2222, and JP2181.",
        "Coached PSOs on becoming Scrum Masters and Scrum Masters on skill enhancement.",
        "Coached team members on PI/ART events, Agile ways of working, and Jira.",
        "Worked with JP9111 & DEF2222 as the product manager.",
        "Provided clarity, direction, and execution on DDG ways of working and Agile best practices for JP9111 and DEF2222."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - Department of Industry and Science (Cloud Platforms)",
      "period": "November 2023 - January 2024",
      "responsibilities": [
        "Worked within the Microsoft Azure Cloud Platforms Team to identify improvements for 2024.",
        "Organized their DevOps environment, documenting all necessary data.",
        "Built their first PowerBI dashboard to display key DevOps information.",
        "Provided guidance to fellow cloud PMs on projects, governance, and best practices.",
        "Managed their “Tech Readiness” project for Microsoft Co-Pilot in conjunction with the DTA."
      ]
    },
    {
      "title": "Senior Strategic Project Manager - CSIRO",
      "period": "December 2022 - November 2023",
      "responsibilities": [
        "Served as Product Owner and project manager for Data Stewards and Software Coding projects.",
        "Implemented data management practices and industry-accepted software coding frameworks within Microsoft Azure.",
        "Leveraged digital library, cybersecurity, and training teams for staff training.",
        "Uplifted the cybersecurity maturity level within the projects.",
        "Created CSIRO's first PM mentorship program.",
        "Worked with CSIRO executives on building their PMO."
      ]
    },
    {
      "title": "Senior Consultant - Jacobs Australia (DDG, Department of Defense)",
      "period": "July 2022 - November 2022",
      "responsibilities": [
        "Analyzed a backlog of over 120 projects as part of the PMO, assessing in-flight projects against the gates process.",
        "Worked with the executive team to hire additional PMs, BAs, and engineers.",
        "Structured the program and developed the budget for board approval.",
        "Created a SAFe methodology framework tailored for the department."
      ]
    },
    {
      "title": "Senior Strategic Program Manager - Department of Defense (SOMIIC)",
      "period": "May 2022 - July 2022",
      "responsibilities": [
        "Re-established alignment within the SOMIIC team and stakeholder connections.",
        "Built and delivered a project/portfolio framework.",
        "Managed initiatives with budgets up to billions of dollars across the Australian Defence Force.",
        "Managed the build-out of ServiceNow along the SAFe model."
      ]
    },
    {
      "title": "Senior Strategic Program Manager - The Architecture Practice (TAP) (Department of Defense, Dept. Aged Care)",
      "period": "November 2021 - May 2022",
      "responsibilities": [
        "Collaborated with TAP ICT solution architects and partners to interview stakeholders.",
        "Provided analysis and recommendations for future work within Microsoft Azure.",
        "Guided the Defense cyber team through their iRAP process.",
        "Helped shape the scheduling and financial aspects of the ADF recompete bid (2.1 billion)."
      ]
    },
    {
      "title": "Senior Consultant - Projects Assured (Services Australia, NDIA, DSS, DVA)",
      "period": "November 2020 - November 2021",
      "responsibilities": [
        "Created a Digital Transformation and Data Management program of work, encompassing 6 internal work streams, 4 agencies, and multiple vendors within Microsoft Azure.",
        "Created a charge-back system for Services Australia, generating revenue.",
        "Successfully delivered a project for DSS to uplift their network to PROTECTED.",
        "Managed the cyber team to achieve maturity level 2 and develop a future roadmap."
      ]
    },
    {
      "title": "Senior Consultant - Veritec (CDPP, The AEC, The Nine Network)",
      "period": "January 2020 - October 2020",
      "responsibilities": [
        "Managed the upgrade of CDPP’s Mobile Device Management system and network uplift to PROTECTED.",
        "Worked as a member of the PMO.",
        "Managed the Nine Network’s digital transformation from Google to Microsoft Azure."
      ]
    },
    {
      "title": "Program Director - Diversity Array Technologies (DArT) (CIMMYT Mexico, Internal company)",
      "period": "January 2019 - January 2020",
      "responsibilities": [
        "Assessed, recommended changes, and executed plans, while hiring additional staff and managing a major client as the product owner.",
        "Structured projects, resources, and budgeting, working with major clients.",
        "Trained DArT staff and CIMMYT (Mexico) on Scrum Agile and best practices for software development in AWS.",
        "Served as the direct customer-facing delivery manager for CIMMYT, visiting Mexico for on-site work.",
        "Managed framework improvements and updates to service integration and management systems."
      ]
    },
    {
      "title": "Program Director - American Driveline (AAMCO)",
      "period": "January 2017 - January 2019",
      "responsibilities": [
        "Program managed the company’s largest modernization program, improving its financial status.",
        "Built teams that delivered a Digital Modernization and Data Management program in Microsoft Azure for 750 franchisees.",
        "Traveled extensively throughout the US and Canada, training franchisees.",
        "Created a CRM dashboard providing up-to-date data on job pricing, parts costs, and revenue information."
      ]
    }
  ],
  "referees": [],
  "templateId": "Rick_Spence_template_2025-06-03T07-04-01-442Z_7d9bbcd6.json",
  "candidateName": "Rick Spence",
  "originalFileName": "Demo_1.pdf",
  "createdAt": "2025-06-03T07:04:01.444Z",
  "updatedAt": "2025-06-03T07:04:01.444Z",
  "isTemplate": true,
  "type": "resume-template"
}